{"config": [{"config": {"kernel_constraint": null, "name": "conv2d_1", "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 50, 50, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "name": "conv2d_2", "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 50, 50, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 512, "trainable": true, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 5, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}